// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// void SecondNum (int num)
// {
//     if(num >= 100 && num <= 999)
//     {
//         int second = num / 10 % 10;
//         System.Console.WriteLine($"цифра {second} является второй цифрой числа {num}");
//     }
//     else
//     {
//         Console.WriteLine("Вы ввели неправильное число");
//     }

// }
// Console.WriteLine("Введите трехзначное число");
// int num = Convert.ToInt32(Console.ReadLine());

// SecondNum(num);

// ----------------------------------------------------------------
